 # DATA CLEANING WITH PANDAS


 Data source - https://data.cityofnewyork.us/Environment/2015-Street-Tree-Census-Tree-Data/uvpi-gqnh/about_data

Handling pandas dataframe - https://sparkbyexamples.com/pandas/how-to-count-duplicates-in-pandas-dataframe/

In [1]:
# Install required modules
%pip install pandas
%pip install matplotlib
%pip install seaborn

Requirement already satisfied: pandas in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (2.2.1)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\admin\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Requirement already satisfied: matplotlib in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (3.8.3)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (1.2.0)
Requirement already satisfied: cycler>=0.10 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (4.49.0)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (1.4.5)
Requirement already satisfied: numpy<2,>=1.21 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (1.26.4)
Requirement already satisfied: packaging>=20.0 in c:\users\admin\appdata\roaming\python\python312\site-packages (from matplotlib) (24.0)
Requirement already satisfied: pillow>=8 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (10.2.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (3.1.2)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\admin\appdata\roaming\python\python312\site-packages (from matplotlib) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.7->matplotlib) (1.16.0)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: seaborn in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (0.13.2)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from seaborn) (1.26.4)
Requirement already satisfied: pandas>=1.2 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from seaborn) (2.2.1)
Requirement already satisfied: matplotlib!=3.6.1,>=3.4 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from seaborn) (3.8.3)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.2.0)
Requirement already satisfied: cycler>=0.10 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (4.49.0)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.4.5)
Requirement already satisfied: packaging>=20.0 in c:\users\admin\appdata\roaming\python\python312\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (24.0)
Requirement already satisfied: pillow>=8 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (10.2.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (3.1.2)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\admin\appdata\roaming\python\python312\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas>=1.2->seaborn) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas>=1.2->seaborn) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
# Import data abd show one observation
df = pd.read_csv('../Data Cleaning Pandas/Data/NewYorkTreesHealthCensus.csv')
df.sample()

,created_at,tree_id,block_id,the_geom,tree_dbh,stump_diam,curb_loc,status,health,spc_latin,...,st_assem,st_senate,nta,nta_name,boro_ct,state,Latitude,longitude,x_sp,y_sp
2558,11/23/2015,437038.0,339989.0,POINT (-73.75446570638874 40.59817799993476),14.0,0,OnCurb,Alive,Good,Platanus x acerifolia,...,31.0,10.0,QN15,Far Rockaway-Bayswater,4099801.0,New York,40.598178,-73.754466,1052435.844,157304.3413

## Explore the dataframe

In [5]:
# View structure of dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 42 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   created_at  50000 non-null  object
 1   tree_id     49873 non-null  float64
 2   block_id    49967 non-null  float64
 3   the_geom    50000 non-null  object
 4   tree_dbh    49895 non-null  float64
 5   stump_diam  50000 non-null  int64
 6   curb_loc    50000 non-null  object
 7   status      49674 non-null  object
 8   health      47732 non-null  object
 9   spc_latin   47732 non-null  object
 10  spc_common  47732 non-null  object
 11  steward     10715 non-null  object
 12  guards      4953 non-null   object
 13  sidewalk    47732 non-null  object
 14  user_type   50000 non-null  object
 15  problems    15603 non-null  object
 16  root_stone  50000 non-null  object
 17  root_grate  50000 non-null  object
 18  root_other  50000 non-null  object
 19  trnk_wire   50000 non-null  object
 20  trnk_light  50000 non-null  object
 21  trnk_other  50000 non-null  object
 22  brnch_ligh  50000 non-null  object
 23  brnch_shoe  50000 non-null  object
 24  brnch_othe  50000 non-null  object
 25  address     50000 non-null  object
 26  zipcode     50000 non-null  int64
 27  zip_city    50000 non-null  object
 28  cb_num      50000 non-null  float64
 29  borocode    50000 non-null  float64
 30  boroname    49976 non-null  object
 31  cncldist    50000 non-null  float64
 32  st_assem    50000 non-null  float64
 33  st_senate   50000 non-null  float64
 34  nta         50000 non-null  object
 35  nta_name    50000 non-null  object
 36  boro_ct     50000 non-null  float64
 37  state       50000 non-null  object
 38  Latitude    50000 non-null  float64
 39  longitude   50000 non-null  float64
 40  x_sp        50000 non-null  float64
 41  y_sp        50000 non-null  float64
dtypes: float64(13), int64(2), object(27)
memory usage: 16.0+ MB

In [6]:
# Structure 
print('Dimension of data : ', df.shape)
print('Dataframe type : ', type(df))

Dimension of data :  (50000, 42)
Dataframe type :  <class 'pandas.core.frame.DataFrame'>

### Subset Data
This is a large dataset, lets subset the data by randomly selecting 5000 observations.

In [7]:
# Select 5000 random rows

subset = df.sample(n=2000)
subset.shape

(2000, 42)

### Drop Columns.

In [8]:
# Column data types
subset.dtypes

created_at     object
tree_id       float64
block_id      float64
the_geom       object
tree_dbh      float64
stump_diam      int64
curb_loc       object
status         object
health         object
spc_latin      object
spc_common     object
steward        object
guards         object
sidewalk       object
user_type      object
problems       object
root_stone     object
root_grate     object
root_other     object
trnk_wire      object
trnk_light     object
trnk_other     object
brnch_ligh     object
brnch_shoe     object
brnch_othe     object
address        object
zipcode         int64
zip_city       object
cb_num        float64
borocode      float64
boroname       object
cncldist      float64
st_assem      float64
st_senate     float64
nta            object
nta_name       object
boro_ct       float64
state          object
Latitude      float64
longitude     float64
x_sp          float64
y_sp          float64
dtype: object

In [9]:
# Print column names
subset.columns.values

array(['created_at', 'tree_id', 'block_id', 'the_geom', 'tree_dbh',
       'stump_diam', 'curb_loc', 'status', 'health', 'spc_latin',
       'spc_common', 'steward', 'guards', 'sidewalk', 'user_type',
       'problems', 'root_stone', 'root_grate', 'root_other', 'trnk_wire',
       'trnk_light', 'trnk_other', 'brnch_ligh', 'brnch_shoe',
       'brnch_othe', 'address', 'zipcode', 'zip_city', 'cb_num',
       'borocode', 'boroname', 'cncldist', 'st_assem', 'st_senate', 'nta',
       'nta_name', 'boro_ct', 'state', 'Latitude', 'longitude', 'x_sp',
       'y_sp'], dtype=object)

In [10]:
# Check columns of integer values
subset.describe()

,tree_id,block_id,tree_dbh,stump_diam,zipcode,cb_num,borocode,cncldist,st_assem,st_senate,boro_ct,Latitude,longitude,x_sp,y_sp
count,1998.000000,2000.000000,1995.000000,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000,2.000000e+03,2000.000000,2000.000000,2.000000e+03,2000.000000
mean,443866.652653,327900.620500,11.612030,0.364500,10920.065500,358.078500,3.503500,31.211500,50.399500,20.313500,3.551536e+06,40.694326,-73.925896,1.004767e+06,192275.549696
std,156676.818201,109497.640547,8.706622,2.794019,655.260626,111.015948,1.122772,14.212169,18.927864,7.413818,1.128016e+06,0.093764,0.134059,3.719482e+04,34159.824623
min,42354.000000,100152.000000,0.000000,0.000000,83.000000,101.000000,1.000000,1.000000,23.000000,10.000000,1.000900e+06,40.500173,-74.253711,9.136973e+05,121598.093800
25%,309734.500000,227485.750000,5.000000,0.000000,10314.000000,305.000000,3.000000,20.000000,32.000000,14.000000,3.028775e+06,40.621102,-73.986238,9.880682e+05,165567.806025
50%,448836.500000,327191.000000,10.000000,0.000000,11212.500000,405.000000,4.000000,30.000000,51.000000,20.000000,4.027200e+06,40.691552,-73.909919,1.009238e+06,191266.697400
75%,575274.500000,408022.500000,16.000000,0.000000,11365.000000,413.000000,4.000000,46.000000,63.000000,24.000000,4.124100e+06,40.759692,-73.824971,1.032718e+06,216072.953150
max,721134.000000,602516.000000,49.000000,49.000000,11694.000000,503.000000,5.000000,51.000000,87.000000,36.000000,5.031902e+06,40.907438,-73.703281,1.066475e+06,269897.507200

In [11]:
# Select few columns 
df2 = subset[['created_at','tree_id','tree_dbh','status','address','boroname','Latitude', 'longitude']]
df2.columns.values

array(['created_at', 'tree_id', 'tree_dbh', 'status', 'address',
       'boroname', 'Latitude', 'longitude'], dtype=object)

In [12]:
# Check the first 5 observations
df2.head()

,created_at,tree_id,tree_dbh,status,address,boroname,Latitude,longitude
4620,10/28/2015,512156.0,18.0,Alive,1023 REVERE AVENUE,Bronx,40.831169,-73.827958
1673,05/09/2016,305829.0,5.0,Alive,43-002 250 STREET,Queens,40.769558,-73.738662
24650,09/17/2015,684577.0,4.0,Alive,384 FULTON STREET,Brooklyn,40.691305,-73.987097
41203,09/12/2015,684354.0,3.0,Alive,2 KINGSLAND AVENUE,Brooklyn,40.716176,-73.940162
48989,01/04/2016,317606.0,6.0,Alive,900 GRAND CONCOURSE,Bronx,40.827501,-73.922259

In [13]:
# Check the first 5 observations
df2.tail()
len(df2)

2000

## Duplicate Values.

These are rows that have exactly the same values across all columns. Since the tree_id uniqely identifies each tree, we will count values in this column.

In [14]:
duplicates = len(df2['tree_id'])-len(df2['tree_id'].drop_duplicates())
duplicates

1

Remove duplicates

In [15]:
df3 = df2.drop_duplicates(subset="tree_id", keep=False, inplace=True)

# Check if duplicate values have been removed 
len(df2)

C:\Users\Admin\AppData\Local\Temp\ipykernel_12116\3704577207.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3 = df2.drop_duplicates(subset="tree_id", keep=False, inplace=True)

1998

### Split Columns.

The address, 23-091 29 STREET, column consists of house number as 23-091 and street name as 29 Street. Lets split these and place each in its own column.

In [16]:
# Check if any column contains a muissing value
print(df2.isnull().any())

created_at    False
tree_id       False
tree_dbh       True
status         True
address       False
boroname      False
Latitude      False
longitude     False
dtype: bool

In [17]:
df2

,created_at,tree_id,tree_dbh,status,address,boroname,Latitude,longitude
4620,10/28/2015,512156.0,18.0,Alive,1023 REVERE AVENUE,Bronx,40.831169,-73.827958
1673,05/09/2016,305829.0,5.0,Alive,43-002 250 STREET,Queens,40.769558,-73.738662
24650,09/17/2015,684577.0,4.0,Alive,384 FULTON STREET,Brooklyn,40.691305,-73.987097
41203,09/12/2015,684354.0,3.0,Alive,2 KINGSLAND AVENUE,Brooklyn,40.716176,-73.940162
48989,01/04/2016,317606.0,6.0,Alive,900 GRAND CONCOURSE,Bronx,40.827501,-73.922259
...,...,...,...,...,...,...,...,...
43538,09/25/2015,646011.0,39.0,Alive,429 81 STREET,Brooklyn,40.626041,-74.026003
36413,11/17/2015,388109.0,11.0,Alive,1299 INTERVALE AVENUE,Bronx,40.830220,-73.893873
39248,07/15/2016,282299.0,11.0,Alive,78-060 82 STREET,Queens,40.703903,-73.866714
26693,09/06/2015,701747.0,14.0,Alive,34-016 43 STREET,Queens,40.755132,-73.918879
25788,06/23/2016,278275.0,14.0,Alive,3-009 147 PLACE,Queens,40.796292,-73.821632

In [59]:
# Split the address column
df2["address"].str.split()

245          [212-004, 35, AVENUE]
14784       [257, PORTAGE, AVENUE]
30153      [280, COLUMBUS, AVENUE]
24030          [264-023, 60, ROAD]
42284     [1555, GRAND, CONCOURSE]
                   ...
39727           [10518, AVENUE, L]
24421     [2030, EAST, 16, STREET]
12864    [151, BAINBRIDGE, STREET]
21762       [114-053, 178, STREET]
20332      [359, SOUTH, 5, STREET]
Name: address, Length: 1997, dtype: object

In [65]:
# Split on the first space delimiter 
df2["address"].str.split(" ", n=1)

245          [212-004, 35 AVENUE]
14784       [257, PORTAGE AVENUE]
30153      [280, COLUMBUS AVENUE]
24030          [264-023, 60 ROAD]
42284     [1555, GRAND CONCOURSE]
                   ...
39727           [10518, AVENUE L]
24421      [2030, EAST 16 STREET]
12864    [151, BAINBRIDGE STREET]
21762       [114-053, 178 STREET]
20332       [359, SOUTH 5 STREET]
Name: address, Length: 1997, dtype: object

In [66]:
# Split and place each on its column 
df2["address"].str.split(" ", n=1, expand=True)

             0                  1
245    212-004          35 AVENUE
14784      257     PORTAGE AVENUE
30153      280    COLUMBUS AVENUE
24030  264-023            60 ROAD
42284     1555    GRAND CONCOURSE
...        ...                ...
39727    10518           AVENUE L
24421     2030     EAST 16 STREET
12864      151  BAINBRIDGE STREET
21762  114-053         178 STREET
20332      359     SOUTH 5 STREET

[1997 rows x 2 columns]

In [ ]:
# Create a new dataframe with additional columns 
df = df2["address"].str.split(" ", n=1, expand=True)